In [14]:
# a.	We are going to read in a data set for the Titanic passenger list.  Downloaded from: https://www.kaggle.com/datasets/yasserh/titanic-dataset?select=Titanic-Dataset.csv
# b.	Import NumPy and Pandas.
# c.	Read the Titanic dataset from 'Titanic-Dataset.csv' into a DataFrame named titanicDataFrame.
# d.	Use the head function (method in the dataframe object) to display the first 5 records as well as column names
# e.	Use the info function (method in the dataframe object) to display metadata information about columns.

import pandas as pd
import numpy as np

# Read and display the first 5 records in the csv file
titanicDf = pd.read_csv('data/Titanic-Dataset.csv')
titanicDf.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
# 12.	Review the dataset to identify and remove columns with excessive null data or minimal relevance, unknown value meanings.
# 13.	In the box below, list the columns that are candidates for removal and provide a solid rationale (3 columns). Hint: age column should not be removed.

"""
In this case, the columns that should be deleted are Cabin, because of a great amount of null values, Parch as it doesn't have much relevance in the file, and Passenger ID which could be used in the case of database queries, but doesn't have a significant role in this case
"""

# Get information to see which columns contain excessive null data or are irrelevant
titanicDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [16]:
# a.	Delete the 3 columns as indicated using the drop method

# Remove irrelevant or excessive null columns
titanicDf.drop('Cabin', axis=1, inplace=True)
titanicDf.drop('Parch', axis=1, inplace=True)
titanicDf.drop('PassengerId', axis=1, inplace=True)
titanicDf

,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,W./C. 6607,23.4500,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,Q

In [17]:
# b.	Display the first 5 rows of the DataFrame using the head function

titanicDf.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,S

In [18]:
# a.	Display the resulting data set and paste the result in the following box

# Create a list with the indexes where age is null
l1 = titanicDf[titanicDf['Age'].isnull()].index
l1

Index([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,
       ...
       832, 837, 839, 846, 849, 859, 863, 868, 878, 888],
      dtype='int64', length=177)

In [19]:
# a.	Using the index property to create a list of row indexes where Age is NaN.
# b.	Use the list of indexes to remove all rows in the data frame.
# c.	Check the updated DataFrame information.

# Use the l1 list to delete the null rows
titanicDf.drop(l1, axis=0, inplace=True)
titanicDf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 714 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  714 non-null    int64
 1   Pclass    714 non-null    int64
 2   Name      714 non-null    object
 3   Sex       714 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     714 non-null    int64
 6   Ticket    714 non-null    object
 7   Fare      714 non-null    float64
 8   Embarked  712 non-null    object
dtypes: float64(2), int64(3), object(4)
memory usage: 55.8+ KB

In [20]:
# d.	Convert the 'Sex' column to numerical values with male=0 and female=1 for easier analysis.
# e.	Check the updated DataFrame information.

# Convert male and female to numbers using the replace method
titanicDf['Sex'] = titanicDf['Sex'].replace({'male': 0, 'female': 1})
titanicDf

C:\Users\aleji\AppData\Local\Temp\ipykernel_20596\3531924086.py:5: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  titanicDf['Sex'] = titanicDf['Sex'].replace({'male': 0, 'female': 1})

,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",0,22.0,1,A/5 21171,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,PC 17599,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",1,26.0,0,STON/O2. 3101282,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,113803,53.1000,S
4,0,3,"Allen, Mr. William Henry",0,35.0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...
885,0,3,"Rice, Mrs. William (Margaret Norton)",1,39.0,0,382652,29.1250,Q
886,0,2,"Montvila, Rev. Juozas",0,27.0,0,211536,13.0000,S
887,1,1,"Graham, Miss. Margaret Edith",1,19.0,0,112053,30.0000,S
889,1,1,"Behr, Mr. Karl Howell",0,26.0,0,111369,30.0000,C
890,0,3,"Dooley, Mr. Patrick",0,32.0,0,370376,7.7500,Q